{"marigold": "Tagetes is a genus of 50 species of annual or perennial, mostly herbaceous plants in the family Asteraceae. They are among several groups of plants known in English as marigolds. The genus Tagetes was described by Carl Linnaeus in 1753.", "bearded iris": "Iris × germanica is the accepted name for a species of flowering plants in the family Iridaceae commonly known as the bearded iris or the German bearded iris. It is of hybrid origin. Varieties include I. × g. var. florentina.", "tree poppy": "Dendromecon, the tree poppy, is a genus of one or two species of shrubs to small trees, native to California and northern Baja California.", "hibiscus": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world. Member species are renowned for their large, showy flowers and those species are commonly known simply as \"hibiscus\", or less widely known as rose mallow. The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees.", "corn poppy": "Papaver rhoeas, with common names including common poppy, corn poppy, corn rose, field poppy, Flanders poppy, red poppy, and Odai, is an annual herbaceous species of flowering plant in the poppy family Papaveraceae. It is native to north Africa and temperate Eurasia and is introduced into temperate areas on all other continents except Antarctica.", "wallflower": "Erysimum, or wallflower, is a genus of flowering plants in the cabbage family, Brassicaceae. It includes more than 150 species, both popular garden plants and many wild forms. Erysimum is characterised by star-shaped trichomes growing from the stem, with yellow, red, pink or orange flowers and multiseeded seed pods.", "lotus": "Nelumbo nucifera, also known as Padma or Kamala, sacred lotus, pink lotus, Indian lotus, or simply lotus, is one of two extant species of aquatic plant in the family Nelumbonaceae. It is sometimes colloquially called a water lily, though this more often refers to members of the family Nymphaeaceae. The lotus belongs in the order Proteales.", "alpine sea holly": "Eryngium alpinum, the alpine sea holly, alpine eryngo or queen of the Alps, is a herbaceous perennial plant in the family Apiaceae.", "ball moss": "Tillandsia recurvata, commonly known as small ballmoss or ball moss, is a flowering plant in the family Bromeliaceae that grows upon larger host plants. It grows well in areas with low light, little airflow, and high humidity, which is commonly provided by southern shade trees, often the southern live oak. It is not a parasite like mistletoe, but an epiphyte like its relative Spanish moss.", "rose": "Rosa or De Rosa may refer to:", "mexican petunia": "Ruellia simplex, the Mexican petunia, Mexican bluebell or Britton's wild petunia, is a species of flowering plant in the family Acanthaceae that is native to Mexico, the Caribbean, and South America. It has become a widespread invasive plant in Florida, where it was likely introduced as an ornamental before 1933, as well as in the eastern Mediterranean, South Asia and other parts of the Eastern Hemisphere.", "prince of wales feathers": "Amaranthus hypochondriacus is an ornamental plant commonly known as Prince-of-Wales feather or prince's-feather. Originally endemic to Mexico, it is called quelite, bledo and quintonil in Spanish.", "wild pansy": "Viola tricolor is a common European wild flower, growing as an annual or short-lived perennial. The species is also known as wild pansy, Johnny Jump up, heartsease, heart's ease, heart's delight, tickle-my-fancy, Jack-jump-up-and-kiss-me, come-and-cuddle-me, three faces in a hood, love-in-idleness, and pink of my john.", "gazania": "Gazania is a genus of flowering plants in the family Asteraceae, native to Southern Africa.", "bee balm": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bergamot, bee balm, horsemint, and oswego tea, the first being inspired by the fragrance of the leaves, which is reminiscent of bergamot orange. The genus was named for the Spanish botanist Nicolás Monardes, who wrote a book in 1574 describing plants of the New World.", "balloon flower": "Platycodon grandiflorus is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia. It is commonly known as balloon flower, Chinese bellflower, or platycodon.", "bishop of llandaff": "Dahlia is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico and Central America. Dahlias are members of the Asteraceae family of dicotyledonous plants, its relatives include the sunflower, daisy, chrysanthemum, and zinnia. There are 49 species of dahlia, with flowers in almost every hue, with hybrids commonly grown as garden plants.", "great masterwort": "Astrantia major, the great masterwort, is a species of flowering plant in the family Apiaceae, native to central and eastern Europe. Growing up to 90 cm (35 in) tall by 45 cm (18 in) broad, it is an herbaceous perennial, much used in gardens.", "poinsettia": "The poinsettia is a commercially important flowering plant species of the diverse spurge family Euphorbiaceae. Indigenous to Mexico and Central America, the poinsettia was first described by Europeans in 1834. It is particularly well known for its red and green foliage and is widely used in Christmas floral displays. It derives its common English name from Joel Roberts Poinsett, the first United States minister to Mexico, who is credited with introducing the plant to the US in the 1820s. Poinsettias are shrubs or small trees, with heights of 0.6 to 4 m. Though often stated to be highly toxic, the poinsettia is not dangerous to pets or children. Exposure to the plant, even consumption, most often results in no effect, though it can cause nausea, vomiting, or diarrhea.", "globe thistle": "Echinops is a genus of about 130 species of flowering plants in the family Asteraceae, commonly known as globe thistles. They have spiny foliage and produce blue or white spherical flower heads. They are distributed from central Asia, Mongolia and north-eastern China to the Mediterranean basin, temperate regions of Eurasia, reaching to Indian subcontinent and tropical Africa. Globe thistle is the host plant of weevils Larinus vulpes and Larinus onopordi.", "bolero deep blue": "Delphinium is a genus of about 300 species of annual and perennial flowering plants in the family Ranunculaceae, native throughout the Northern Hemisphere and also on the high mountains of tropical Africa. The genus was erected by Carl Linnaeus.", "pink primrose": "Primula vulgaris is a species of flowering plant in the family Primulaceae, native to Eurasia. The common name of this plant is primrose, or occasionally common primrose or English primrose to distinguish it from other Primula species referred to as primroses.", "bird of paradise": "Strelitzia reginae, commonly known as the crane flower, bird of paradise, or isigude in Nguni, is a species of flowering plant native to the Cape Provinces and KwaZulu-Natal in South Africa. An evergreen perennial, it is widely cultivated for its dramatic flowers. In temperate areas it is a popular houseplant.", "purple coneflower": "Echinacea purpurea, the eastern purple coneflower, purple coneflower, hedgehog coneflower, or Echinacea, is a North American species of flowering plant in the family Asteraceae. It is native to parts of eastern North America and present to some extent in the wild in much of the eastern, southeastern and midwestern United States, as well as in the Canadian Province of Ontario. It is most common in the Ozarks, the Mississippi Valley, and the Ohio Valley. Its habitats include dry open woods, prairies, and barrens.", "water lily": "Nymphaea is a genus of hardy and tender aquatic plants in the family Nymphaeaceae. The genus has a cosmopolitan distribution. Many species are cultivated as ornamental plants, and many cultivars have been bred. Some taxa occur as introduced species where they are not native, and some are weeds. Plants of the genus are known commonly as water lilies, or waterlilies in the United Kingdom.", "clematis": "Clematis is a genus of about 380 species within the buttercup family, Ranunculaceae. Their garden hybrids and cultivars have been popular among gardeners, beginning with Clematis 'Jackmanii', a garden staple since 1862. More cultivars are being produced constantly, mainly of Chinese and Japanese origin.", "watercress": "Watercress or yellowcress is a species of aquatic flowering plant in the cabbage family, Brassicaceae.", "giant white arum lily": "Zantedeschia aethiopica, commonly known as calla lily and arum lily, is a species of flowering plant in the family Araceae, native to southern Africa in Lesotho, South Africa, and Eswatini.", "barbeton daisy": "Gerbera jamesonii is a species of flowering plant in the genus Gerbera belonging to the basal Mutisieae tribe within the large Asteraceae family. It is indigenous to South Eastern Africa and commonly known as the Barberton daisy, the Transvaal daisy, and as Barbertonse madeliefie or Rooigousblom in Afrikaans. It was the first species of Gerbera to be the subject of a scientific description, studied by J. D. Hooker in Curtis's Botanical Magazine in 1889.", "pincushion flower": "Scabiosa is a genus in the honeysuckle family (Caprifoliaceae) of flowering plants. Many of the species in this genus have common names that include the word scabious, but some plants commonly known as scabious are currently classified in related genera such as Knautia and Succisa; at least some of these were formerly placed in Scabiosa. Another common name for members of this genus is pincushion flowers.", "desert-rose": "Adenium obesum, more commonly known as a desert rose, is a poisonous species of flowering plant belonging to the tribe Nerieae of the subfamily Apocynoideae of the dogbane family, Apocynaceae. It is native to the Sahel regions south of the Sahara, tropical and subtropical eastern and southern Africa, as well as the Arabian Peninsula. Other names for the flower include Sabi star, kudu, mock azalea, and impala lily. Adenium obesum is a popular houseplant and bonsai in temperate regions.", "king protea": "Protea cynaroides, also called the king protea, is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot, or king sugar bush. It is widely distributed in the fynbos region of South Africa, that is, in the southwestern and southern parts of Western Cape. The king protea is the national flower of South Africa.", "sword lily": "Gladiolus is a genus of perennial cormous flowering plants in the iris family (Iridaceae).", "petunia": "Petunia is a genus of 20 species of flowering plants of South American origin. The popular flower of the same name derived its epithet from the French, which took the word pétun, 'tobacco', from a Tupi–Guarani language. A tender perennial plant, most of the varieties seen in gardens are hybrids.", "fire lily": "Lilium bulbiferum, common names orange lily, fire lily, Jimmy's Bane, tiger lily and St. John's Lily, is a herbaceous European lily with underground bulbs, belonging to the Liliaceae.", "gaura": "Oenothera is a genus of about 145 species of herbaceous flowering plants native to the Americas. It is the type genus of the family Onagraceae. Common names include evening primrose, suncups, and sundrops. They are not closely related to the true primroses.", "osteospermum": "Osteospermum, is a genus of flowering plants belonging to the Calenduleae, one of the smaller tribes of the sunflower/daisy family Asteraceae. They are known as the daisybushes or African daisies. Its species have been given several common names, including African daisy, South African daisy, Cape daisy and blue-eyed daisy.", "common dandelion": "Taraxacum officinale, the dandelion or common dandelion, is a herbaceous perennial flowering plant in the daisy family, Asteraceae. The common dandelion is well-known for its yellow flower heads that turn into round balls of many silver-tufted fruit, which disperse in the wind. These balls are sometimes called \"clocks\" or \"blowballs\".", "cautleya spicata": "Cautleya spicata is a perennial herbaceous plant in the family Zingiberaceae. It is found in the Himalayas through to China (Yunnan). It is cultivated as an ornamental garden plant, hardy to a few degrees of frost.", "stemless gentian": "Gentiana acaulis, the stemless gentian, or trumpet gentian, is a species of flowering plant in the family Gentianaceae, native to central and southern Europe, from Spain east to the Balkans, growing especially in mountainous regions, such as the Alps and Pyrenees, at heights of 800–3,000 m (2,625–9,843 ft).", "californian poppy": "Eschscholzia californica, the California poppy, golden poppy, Mexican poppy, California sunlight or cup of gold, is a species of flowering plant in the family Papaveraceae, native to the United States and Mexico. It is cultivated as an ornamental plant flowering in summer, with showy flowers in brilliant shades of red, orange and yellow. It is also used as food or a garnish. It had various uses in indigenous herbalism. It became the official state flower of California in 1903.", "windflower": "Anemonoides nemorosa, the wood anemone, is an early-spring flowering plant in the buttercup family Ranunculaceae, native to Europe. Other common names include windflower, European thimbleweed, and smell fox, an allusion to the musky smell of the leaves. It is a perennial herbaceous plant growing 5–15 cm (2–6 in) tall.", "spear thistle": "Cirsium vulgare, commonly known as spear thistle, bull thistle, or common thistle, is a species of the Asteraceae genus Cirsium, native throughout most of Europe, Western Asia, and northwestern Africa. It is also naturalised in North America, Africa, and Australia and is an invasive weed in several regions. It is the national flower of Scotland.", "ruby-lipped cattleya": "Cattleya is a genus of orchids from Costa Rica south to Argentina. The genus is abbreviated C in trade journals.", "japanese anemone": "Eriocapitella hupehensis, a species of flowering plant in the Ranunculaceae family of plants and has an extensive native distribution across a large area of Asia. The plant was previously known as Anemone hupehensis and is often still referred to as such. Together with several closely related species and hybrids between these species, in horticulture these plants are often referred to as Japanese anemones.", "sunflower": "The common sunflower is a species of large annual forb of the daisy family Asteraceae. The common sunflower is harvested for its edible oily seeds, which are often eaten as a snack food. They are also used in the production of cooking oil, as food for livestock, as bird food, and as plantings in domestic gardens for aesthetics. Wild plants are known for their multiple flower heads, whereas the domestic sunflower often possesses a single large flower head atop an unbranched stem.", "thorn apple": "Datura stramonium, known by the common names thornapple, jimsonweed, or devil's trumpet, is a poisonous flowering plant in the Daturae tribe of the nightshade family Solanaceae. Its likely origin was in Central America, and it has been introduced in many world regions. It is an aggressive invasive weed in temperate climates and tropical climates across the world. D. stramonium has frequently been employed in traditional medicine to treat a variety of ailments. It has also been used as a hallucinogen, taken entheogenically to cause intense, sacred or occult visions. It is unlikely ever to become a major drug of abuse owing to effects upon both mind and body frequently perceived as being highly unpleasant, giving rise to a state of profound and long-lasting disorientation or delirium with a potentially fatal outcome. It contains tropane alkaloids which are responsible for the psychoactive effects, and may be severely toxic.", "bromelia": "Bromelia is a genus of about 70 plant species widespread across Latin America and the West Indies. It is the type genus of the family Bromeliaceae, subfamily Bromelioideae, and its type species is B. karatas. Bromelia species are characterized by flowers with a deeply cleft calyx. The genus is named after the Swedish medical doctor and botanist Olof Bromelius (1639-1705).", "artichoke": "The artichoke, also known by the other names: French artichoke, globe artichoke, and green artichoke in the United States, is a variety of a species of thistle cultivated as food.", "peruvian lily": "Alstroemeria, commonly called the Peruvian lily or lily of the Incas, is a genus of flowering plants in the family Alstroemeriaceae. They are all native to South America, although some have become naturalized in the United States, Mexico, Australia, New Zealand, Madeira and the Canary Islands. Almost all of the species are restricted to one of two distinct centers of diversity: one in central Chile and southern Argentina, the other in eastern Brazil. Species of Alstroemeria from Patagonia are winter-growing plants, while those of Brazil are summer growing. All are long-lived perennials except A. graminea, a diminutive annual from the Atacama Desert of Chile.", "morning glory": "Ipomoea is the largest genus in the plant family Convolvulaceae, with over 600 species. It is a large and diverse group, with common names including morning glory, water convolvulus or water spinach, sweet potato, bindweed, moonflower, etc. The genus occurs throughout the tropical and subtropical regions of the world, and comprises annual and perennial herbaceous plants, lianas, shrubs, and small trees; most of the species are twining climbing plants.", "canna lily": "Canna may refer to:", "blanket flower": "Gaillardia is a genus of flowering plants in the family Asteraceae, native to North and South America. It was named after Maître Gaillard de Charentonneau, an 18th-century French magistrate who was an enthusiastic botanist. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use.", "azalea": "Rhododendron, from Ancient Greek ῥόδον (rhódon), meaning \"rose\", and δένδρον (déndron), meaning \"tree\", is a very large genus of about 1,024 species of woody plants in the heath family (Ericaceae). They can be either evergreen or deciduous. Most species are native to eastern Asia and the Himalayan region, but smaller numbers occur elsewhere in Asia, and in North America, Europe and Australia.", "black-eyed susan": "Rudbeckia hirta, commonly called black-eyed Susan and yellow coneflower, is a North American flowering plant in the family Asteraceae. It grows to 1 metre tall with daisy-like yellow flower heads. There are numerous cultivars. It is toxic when ingested by cats, but was used medicinally by Native Americans. It is the state flower of Maryland.", "trumpet flower": "Trumpetflower or trumpet flower may refer to several plants:Chinese trumpet flower, Incarvillea, native to central and eastern Asia\nEvening trumpetflower, Gelsemium sempervirens, native to North America\nIndian trumpetflower, Oroxylum indicum, native to India\nVelvet trumpet flower, Salpiglossis sinuata, native to Chile\nWavy trumpet flower, Dolichandrone atrovirens, native to India", "hard-leaved pocket orchid": "Caladenia, commonly known as spider orchids, is a genus of 350 species of plants in the orchid family, Orchidaceae. Spider orchids are terrestrial herbs with a single hairy leaf and a hairy stem. The labellum is fringed or toothed in most species and there are small projections called calli on the labellum. The flowers have adaptations to attract particular species of insects for pollination. The genus is divided into three groups on the basis of flower shape, broadly, spider orchids, zebra orchids and cowslip orchids, although other common names are often used. Although they occur in other countries, most are Australian and 136 species occur in Western Australia, making it the most species-rich orchid genus in that state.", "snapdragon": "Antirrhinum majus, the common snapdragon, is a species of flowering plant belonging to the genus Antirrhinum. The plant was placed in the family Plantaginaceae following a revision of its prior classical family, Scrophulariaceae.", "sweet william": "No information available for Sweet William.", "colt's foot": "Tussilago farfara, commonly known as coltsfoot, is a plant in the tribe Senecioneae in the family Asteraceae, native to Europe and parts of western and central Asia. The name \"tussilago\" is derived from the Latin tussis, meaning cough, and ago, meaning to cast or to act on. It has had uses in traditional medicine, but the discovery of toxic pyrrolizidine alkaloids in the plant has resulted in liver health concerns.", "monkshood": "Aconitum, also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous, frequently toxic perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere in North America, Europe, and Asia, growing in the moisture-retentive but well-draining soils of mountain meadows.", "siam tulip": "Curcuma alismatifolia, Siam tulip or summer tulip is a tropical plant native to Laos, northern Thailand, and Cambodia. Despite its name, it is not related to the tulip, but is a close relative of turmeric. It can grow as an indoor plant. It is a perennial herb growing up to 2 feet tall.", "globe-flower": "Trollius europaeus, the globeflower, is a perennial flowering plant of the family Ranunculaceae. The plant is native to Europe and Western Asia and is a protected species in Russia and Bulgaria.", "canterbury bells": "No information available for Canterbury Bells.", "english marigold": "Calendula officinalis, Mary's gold, common marigold, the pot marigold, Scotch marigold, or ruddles, is a flowering plant in the daisy family, Asteraceae. It is probably native to southern Europe, but its long history of cultivation makes its precise origin unknown, and it is widely naturalised. The florets are edible and the plant has historically been used as medicine.", "anthurium": "Anthurium is a genus of about 1,000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, pigtail plant, and laceleaf.", "sweet pea": "The sweet pea, Lathyrus odoratus, is a flowering plant in the genus Lathyrus in the family Fabaceae (legumes), native to Sicily, southern Italy and the Aegean Islands.", "grape hyacinth": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth, but they should not be confused with hyacinths. A number of species of Muscari are used as ornamental garden plants.", "foxglove": "Digitalis is a genus of about 20 species of herbaceous perennial plants, shrubs, and biennials, commonly called foxgloves.", "hippeastrum": "Hippeastrum is a genus of 116 species, and over 600 hybrids and cultivars, of perennial, herbaceous and bulbous plants, native to tropical and subtropical regions of the Americas, from Mexico south to Argentina and on some islands in the Caribbean. The majority have large, fleshy bulbs and tall, broad, strap-like leaves that are (generally) evergreen, and large red or purple flowers. Numerous colors and cultivars have been created over the past hundred years.", "oxeye daisy": "Leucanthemum vulgare, commonly known as the ox-eye daisy, oxeye daisy, dog daisy, marguerite and other common names, is a widespread flowering plant native to Europe and the temperate regions of Asia, and an introduced plant to North America, Australia and New Zealand.", "mallow": "Malva is a genus of herbaceous or woody, annual, biennial, and perennial plants in the family Malvaceae. It is one of several closely related genera in the family to bear the common English name mallow. The genus is widespread throughout the temperate, subtropical and tropical regions of Africa, Asia and Europe.", "bougainvillea": "Bougainvillea is a genus of thorny ornamental vines, bushes, and trees belonging to the family Nyctaginaceae. They are native to Mexico, Brazil, Bolivia, Paraguay, Peru, and Argentina. There are between 4 and 22 species in the genus. The inflorescence consists of large colourful sepal-like bracts which surround three simple waxy flowers, gaining popularity for the plant as an ornamental. The plant is named after explorer Louis Antoine de Bougainville (1729–1811), after it was documented on one of his expeditions.", "cyclamen": "Cyclamen is a genus of 25 species of perennial flowering plants in the family Primulaceae. In English, it is known by the common names sowbread or swinebread. Cyclamen species are native to Europe and the Mediterranean Basin east to the Caucasus and Iran, with one species in Somalia. They grow from tubers and are valued for their flowers with upswept petals and variably patterned leaves.", "tiger lily": "Lilium lancifolium is an Asian species of lily, native to China, Japan, Korea, and the Russian Far East. It is widely planted as an ornamental because of its showy orange-and-black flowers, and sporadically occurs as a garden escapee in North America, particularly the eastern United States including New England, and has made incursions into some southern states such as Georgia.", "cape flower": "Clivia miniata, the Natal lily or bush lily, is a species of flowering plant in the genus Clivia of the family Amaryllidaceae, native to woodland habitats in South Africa and Eswatini. It is also widely cultivated as an ornamental.", "passion flower": "Passiflora, known also as the passion flowers or passion vines, is a genus of about 550 species of flowering plants, the type genus of the family Passifloraceae.", "yellow iris": "Iris pseudacorus, the yellow flag, yellow iris, or water flag, is a species of flowering plant in the family Iridaceae. It is native to Europe, western Asia and northwest Africa. Its specific epithet pseudacorus means \"false acorus\", referring to the similarity of its leaves to those of Acorus calamus, as they have a prominently veined mid-rib and sword-like shape. However, the two plants are not closely related.", "tree mallow": "Malva is a genus of herbaceous annual, biennial, and perennial plants in the family Malvaceae. It is one of several closely related genera in the family to bear the common English name mallow. The genus is widespread throughout the temperate, subtropical and tropical regions of Africa, Asia and Europe.", "carnation": "Dianthus caryophyllus, commonly known as carnation or clove pink, is a species of Dianthus native to the Mediterranean region. While its exact natural range is uncertain due to extensive cultivation over the last 2,000 years, wild carnations are most common in the Mediterranean region. Carnations are prized for their wide variety of colors, delicate fringed petals, and fragrance, often described as spicy, clove-like, or reminiscent of a combination of cinnamon and nutmeg, hence the common name \"clove pink\". This aroma has made carnations a popular choice for use in perfumes, potpourri, and scented products. Culturally, carnations are associated with affection, distinction, and maternal love, with variations depending on color and area within its wide geographical range.", "blackberry lily": "Iris domestica, commonly known as leopard lily, blackberry lily, and leopard flower, is an ornamental plant in the family Iridaceae. In 2005, based on molecular DNA sequence evidence, Belamcanda chinensis, the sole species in the genus Belamcanda, was transferred to the genus Iris and renamed Iris domestica.", "frangipani": "Plumeria, also known as frangipani, is a genus of flowering plants in the subfamily Rauvolfioideae, of the family Apocynaceae. Most species are deciduous shrubs or small trees. The species are native to the Neotropical realm, but are often grown as cosmopolitan ornamentals in tropical regions, especially in Hawaii, as well as hot desert climates in the Arabian Peninsula with proper irrigation.", "mexican aster": "Cosmos bipinnatus, commonly called the garden cosmos, Mexican aster or cosmea, is a medium-sized flowering herbaceous plant in the daisy family Asteraceae, native to the Americas. The species and its varieties and cultivars are popular as ornamental plants in temperate climate gardens.", "daffodil": "Narcissus most commonly refers to:Narcissus (mythology), a character from Greek mythology\nNarcissus (plant), a genus of flowering plants also known as daffodils", "buttercup": "Ranunculus is a large genus of about 1750 species of flowering plants in the family Ranunculaceae. Members of the genus are known as buttercups, spearworts and water crowfoots.", "spring crocus": "Crocus is a genus of seasonal flowering plants in the family Iridaceae comprising about 100 species of perennials growing from corms.", "orange dahlia": "Dahlia is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico and Central America. Dahlias are members of the Asteraceae family of dicotyledonous plants, its relatives include the sunflower, daisy, chrysanthemum, and zinnia. There are 49 species of dahlia, with flowers in almost every hue, with hybrids commonly grown as garden plants.", "toad lily": "Tricyrtis is a genus of Asian flowering plants in the lily family, with approximately 20 known species. The species are commonly known in English as toad lilies. The genus has a native range from the Himalayas to eastern Asia, including China, Japan, Philippines and Taiwan, and a few species are cultivated for their ornamental qualities in other parts of the world."}